/*
 * Вычисление контрольных сумм.
 */

#include "crc.h"


/*===============================================================================================*/
#if defined(LES_CRC)
/*-----------------------------------------------------------------------------------------------*/
unsigned short eval_crc16(unsigned short crc, const unsigned char *msg, unsigned msg_len)
{
	/* Вычисление 16-разрядного циклического избыточного кода (ЦИК - CRC)
	*  crc     - исходное значение ЦИК, 0 при первом вызове
	*  msg     - указатель блока сообщения
	*  msg_len - число байтов в блоке
	*  Возвращает 16-разрядный ЦИК
	*/
	
	const unsigned short crc_poly = 0x1021;			/* порождающий многочлен */
	unsigned char        j;
	
	
	while (msg_len-- > 0)
	{
		crc ^= (unsigned short)*msg++ << 8;
		
		for (j = 8; j > 0; j--)				/* проверка каждого бита */
		{
			if (crc & 0x8000)
			{
				crc = crc << 1 ^ crc_poly;
			}
			else
			{
				crc <<= 1;
			}
		}
	}
	
	return crc & 0xffff;
}
/*-----------------------------------------------------------------------------------------------*/
#endif						/*#if defined(LES_CRC)*/
/*===============================================================================================*/